INSERT INTO company (title) VALUES
('Apple'),
('Google');


INSERT INTO phone (name, description, company_id) VALUES
('IPhone 15', 'Смартфон Apple iPhone 15 привлекает внимание безрамочным дисплеем 6.1”. Разрешение 2556x1179 dpi сохраняет четкость и насыщенность картинки, точную передачу цвета при любом освещении. 6-ядерный процессор Apple A16 Bionic с ОЗУ 6 ГБ гарантирует высокий уровень производительности. 2 тыловые камеры 48 +12 Мп позволяют делать эффектные фото и видео с углом обзора 120° и 4K-разрешением.', 1),
('Pixel 8', 'Google Pixel 8 оснастили 6,2-дюймовым AMOLED-дисплеем с разрешением 1080 × 2400 пикселей. Поддерживается частота обновления 60–120 Гц. Пиковая яркость составляет 2000 нит. В смартфоне используется фронтальная камера на 10,5 Мп с апертурой f/2.2. В Pixel 8 используется 50-мегапиксельный главный сенсор с апертурой f/1.68 и «сверхширик» на 12 Мп (f/2.2). Камеры поддерживают запись видео в разрешении 4K с частотой 60 fps. \nGoogle добавила фильтр Real Tone, который делает цвет кожи на фото более естественным. Также компания реализовала ИИ-фичу Audio Magic Eraser, которая убирает фоновый шум на видео. Еще одна крутая фича называется Best Take. Алгоритмы ИИ могут подставить лучшее выражение лица из серии фотографий, чтобы получился идеальный снимок.', 2);
